import React from 'react'


/*-----------------------------------*/
/*-----------------------------------*/
// RENDER ЭЛЕМЕНТА MENU
// ВЛОЖЕН В РЕНДЕР СПИСКА MENU
/*-----------------------------------*/
/*-----------------------------------*/
const FileItem = ({file}) => {
    return (
        <div>
            <p>{file.name}</p>
        </div>
    )
}

/*-----------------------------------*/
/*-----------------------------------*/
// RENDER СПИСКА MENU
/*-----------------------------------*/
/*-----------------------------------*/
const FilesList = ({ files }) => {
    return (
        <div>
            {files.map((file) => <FileItem file={file} />)}
        </div>
    )
}


export default FilesList;
